RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_dma.c
/**
  **********************************************************************************************************************
  * @file    stm32h7rsxx_hal_dma.c
  * @author  MCD Application Team
  * @brief   This file provides firmware functions to manage the following functionalities of the Direct Memory Access
  *          (DMA) peripheral:
  *            + Initialization/De-Initialization Functions
  *            + I/O Operation Functions
  *            + State and Errors Functions
  *            + DMA Attributes Functions
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                       ##### How to use this driver #####
  ======================================================================================================================
  [..]
   (#) GPDMA and HPDMA are made available on this series.
       Transfer could be done thanks to AXI or AHB ports.

       HPDMA support transmission through:
         AXI port 0.
         AHB port 1.
       GPDMA allows transmission through:
         GPDMA_P = port-0.
         GPDMA_M = port-1

       The following table list the supported configurations for HPDMA.
       HPDMA support the following transfer
       Table 1. HPDMA: supported transfer with source (SAP in CTR1 register)
       / (DAP in CTR1 register) destination settings.
       +-----------------------------------------------------------------------+
       |      Destination|0 1 2 3 | 4 5    | 6      | 7      | 8      | 9      |
       | Source          |        |        |        |        |        |        |
       |-----------------|--------|--------|--------|--------|--------|--------|
       | 0 1 2 3         |0/0     |0/0-1   |0/0-1   |0/1     |0/0     |0/1     |
       |-----------------|--------|--------|--------|--------|--------|--------|
       | 4 5             |0-1/0   |0-1/0-1 |0-1/0-1 |0-1/1   |0-1/0   |0-1/1   |
       +-----------------------------------------------------------------------+
       | 6               |0-1/0   |0-1/0-1 |0-1/0-1 |0-1/1   |0-1/0   |0-1/1   |
       +-----------------------------------------------------------------------+
       | 7               |1/0     |1/0-1   |1/0-1   |1/1     |1/0     |1/1     |
       +-----------------------------------------------------------------------+
       | 8 9             |0/0     |0/0-1   |0/0-1   |0/1     |0/0     |0/1     |
       +-----------------------------------------------------------------------+
       | 10 11           |1/0     |1/0-1   |1/0-1   |1/1     |1/0     |1/1     |
       +-----------------------------------------------------------------------+

       Source:
       0  AXI_SRAM_IC1_L1
       1  AXI_SRAM_IC2_L2
       2  AXI_SRAM_IC3_L3
       3  AXI_SRAM_IC4_L4
       4  AHB_SRAM1_IC2_L0
       5  AHB_SRAM2_IC2_L1
       6  BACKUP_SRAM
       7  DTCM
       8  FLASH_IC1_L0
       9  GFXMMU_RAM
       10 FDCAN_SRAM
       11 ITCM

       Destination:
       0  AXI_SRAM_IC1_L1
       1  AXI_SRAM_IC2_L2
       2  AXI_SRAM_IC3_L3
       3  AXI_SRAM_IC4_L4
       4  AHB_SRAM1_IC2_L0
       5  AHB_SRAM2_IC2_L1
       6  BACKUP_SRAM
       7  DTCM
       8  GFXMMU_RAM
       9  FDCAN_SRAM

       The following table list the supported configurations for GPDMA.
       GPDMA support the following transfer
       Table 2. GPDMA: supported transfer with source (SAP in CTR1 register)
       / (DAP in CTR1 register) destination settings.
       +-----------------------------------------------------------------------+
       |      Destination|0 1 2 3 | 4 5    | 6      | 7      | 8      | 9      |
       | Source          |        |        |        |        |        |        |
       |-----------------|--------|--------|--------|--------|--------|--------|
       | 0 1 2 3         |0-1/0   |0-1/0-1 |0-1/0-1 |  XXX   |  XXX   |0-1/0-1 |
       |-----------------|--------|--------|--------|--------|--------|--------|
       | 4 5             |0-1/0   |0-1/0-1 |0-1/0-1 |  XXX   |  XXX   |0-1/0-1 |
       +-----------------------------------------------------------------------+
       | 6               |0-1/0   |0-1/0-1 |0-1/0-1 |  XXX   |  XXX   |0-1/0-1 |
       +-----------------------------------------------------------------------+
       | 7               |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |
       +-----------------------------------------------------------------------+
       | 8               |0-1/0   |0-1/0-1 |0-1/0-1 |  XXX   |  XXX   |0-1/0-1 |
       +-----------------------------------------------------------------------+
       | 9               |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |
       +-----------------------------------------------------------------------+
       | 10              |0-1/0   |0-1/0-1 |0-1/0-1 |  XXX   |  XXX   |0-1/0-1 |
       +-----------------------------------------------------------------------+
       | 11              |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |  XXX   |
       +-----------------------------------------------------------------------+

       Link-list transfer requires the nodes to be located in a memory than be be
       accessed by the HPDMA or GPDMA.

       Table 3. HPDMA: supported linked-list node memory location versus Linked-List
       allocated port (LPA in CCR register).
       +--------------------------+
       |                 | Port   |
       | Node location   |        |
       |-----------------|--------|
       | 0 1 2 3         |   0    |
       |-----------------|--------|
       | 4 5             |  0-1   |
       +---------------------------
       | 6               |  0-1   |
       +---------------------------
       | 7               |   1    |
       +---------------------------
       | 8 9             |   0    |
       +---------------------------
       | 10 11           |   1    |
       +--------------------------+

